---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSizeSettings.GetDuctSizeSettings(Autodesk.Revit.DB.Document)
source: html/a402c704-e6fc-19d4-993f-a7fc7d61bc23.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizeSettings.GetDuctSizeSettings Method

Get the duct size settings of the project.

## Syntax (C#)
```csharp
public static DuctSizeSettings GetDuctSizeSettings(
	Document aDoc
)
```

## Parameters
- **aDoc** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The duct size settings of the project.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null